;; -*- no-byte-compile: t; -*-
;;; ~/.config/doom/packages.el

(package! atomic-chrome)
(package! company-racer :disable :ignore) ;; racer's capf backend is better
(package! ein)
(package! evil-lion)
(package! fish-mode)
(package! flycheck-rust :disable :ignore)
(package! ggtags)
(package! lsp-mode)
(package! lsp-rust)
(package! page-break-lines)
(package! phpcbf)
(package! pkgbuild-mode)
(package! racer :disable :ignore)
(package! yapfify)
