;; -*- no-byte-compile: t; -*-
;;; ~/.config/doom/packages.el

(package! ein)
(package! evil-lion)
(package! ggtags)
(package! kotlin-mode)
(package! ob-ipython)
(package! page-break-lines)
(package! phpcbf)
(package! pkgbuild-mode)
(package! racer :disable t :ignore t) ;; Handled through rls instead

;; +lsp
(package! company-lsp)
(package! lsp-mode)
(package! lsp-ui)
